In [3]:
import pandas as pd

---
**Exercício 1: Criando Series**

Crie duas Series Pandas:

1.​ Uma Series chamada frutas com os valores: 'Maçã', 'Banana', 'Laranja',
'Morango', e índices correspondentes: 'A', 'B', 'C', 'D'.

2.​ Uma Series chamada precos com os valores: 2.50, 1.80, 3.20, 4.00, e utilize
os mesmos índices da Series frutas.


---

In [4]:
frutas = pd.Series(['maca','banana','laranja','morango'], index=['A','B','C','D'])

In [5]:
frutas

A       maca
B     banana
C    laranja
D    morango
dtype: object

In [6]:
precos = pd.Series([2.50,1.80,3.20,4.00], index=['A','B','C','D'])

In [7]:
precos

A    2.5
B    1.8
C    3.2
D    4.0
dtype: float64

---

**Exercício 2: Criando DataFrames**

Crie um DataFrame Pandas chamado alunos a partir do seguinte dicionário:

dados_alunos = {
'Nome': ['Ana', 'Bruno', 'Carla', 'Daniel', 'Elisa'],
'Idade': [20, 22, 21, 23, 19],
'Curso': ['Engenharia', 'Computação', 'Medicina', 'Direito', 'Biologia']
}

---

In [8]:
alunos = pd.DataFrame({
    'nome':['ana','bruno','carla','daniel','elisa'],
    'idade':[20,22,21,23,19],
    'cursos':['engenharia','computacao','medicina','direito','biologia']
})

In [9]:
alunos

     nome  idade      cursos
0     ana     20  engenharia
1   bruno     22  computacao
2   carla     21    medicina
3  daniel     23     direito
4   elisa     19    biologia

---

**Exercício 3: Acessando Dados em Series e DataFrames**

1.​ Na Series frutas criada no Exercício 1, acesse o valor correspondente ao
índice 'C'.

2.​ No DataFrame alunos criado no Exercício 2, selecione apenas a coluna
'Nome'.

3.​ Selecione as colunas 'Nome' e 'Curso' do DataFrame alunos.

___

In [10]:
frutas['C']

'laranja'

In [11]:
alunos['nome']

0       ana
1     bruno
2     carla
3    daniel
4     elisa
Name: nome, dtype: object

In [12]:
alunos[['nome','cursos']]

     nome      cursos
0     ana  engenharia
1   bruno  computacao
2   carla    medicina
3  daniel     direito
4   elisa    biologia

---

**Exercício 4: Filtrando DataFrames**

No DataFrame alunos, filtre e mostre apenas os alunos com idade igual ou
superior a 21 anos.

---

In [13]:
alunos[alunos['idade'] > 21]

     nome  idade      cursos
1   bruno     22  computacao
3  daniel     23     direito

---

**Exercício 5: Adicionando e Removendo Colunas**

1.​ Adicione uma nova coluna chamada 'Cidade' ao DataFrame alunos com os
seguintes valores: 'São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Salvador',
'Recife'.

2.​ Remova a coluna 'Curso' do DataFrame alunos.

___

In [14]:
alunos['cidade'] = ['sao paulo','rio de janeiro','belo horizonte','salvador','recife']

In [15]:
alunos

     nome  idade      cursos          cidade
0     ana     20  engenharia       sao paulo
1   bruno     22  computacao  rio de janeiro
2   carla     21    medicina  belo horizonte
3  daniel     23     direito        salvador
4   elisa     19    biologia          recife

In [16]:
alunos.drop('cursos', axis=1)

     nome  idade          cidade
0     ana     20       sao paulo
1   bruno     22  rio de janeiro
2   carla     21  belo horizonte
3  daniel     23        salvador
4   elisa     19          recife

---

**Exercício 6: Agrupamento de Dados**

Crie o seguinte DataFrame de vendas por produto e categoria:

vendas_categoria = {
'Produto': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
'Categoria': ['Eletrônicos', 'Vestuário', 'Eletrônicos', 'Alimentos', 'Vestuário', 'Alimentos',
'Eletrônicos'],
'Valor': [100, 50, 120, 30, 60, 40, 110]
}

df_vendas_cat = pd.DataFrame(vendas_categoria)

Agrupe o DataFrame por 'Categoria' e calcule a soma do 'Valor' para cada
categoria.

___

In [17]:
vendas_categoria = pd.DataFrame({
'Produto': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
'Categoria': ['Eletrônicos', 'Vestuário', 'Eletrônicos', 'Alimentos', 'Vestuário', 'Alimentos',
'Eletrônicos'],
'Valor': [100, 50, 120, 30, 60, 40, 110]
})

In [19]:
vendas_categoria.columns

Index(['Produto', 'Categoria', 'Valor'], dtype='object')

In [21]:
vendas_categoria.groupby('Categoria')['Valor'].sum()

Categoria
Alimentos       70
Eletrônicos    330
Vestuário      110
Name: Valor, dtype: int64

---

**Exercício 7: Ordenando DataFrames** 

Ordene o DataFrame alunos(criado no Exercício 2, com a coluna 'Cidade' 
adicionada no Exercício 5) em ordem alfabética pela coluna 'Nome'. 

---

In [22]:
alunos = pd.DataFrame({
    'nome':['ana','bruno','carla','daniel','elisa'],
    'idade':[20,22,21,23,19],
    'cursos':['engenharia','computacao','medicina','direito','biologia']
})

In [23]:
alunos['cidade'] = ['sao paulo','rio de janeiro','belo horizonte','salvador','recife']

In [24]:
alunos

     nome  idade      cursos          cidade
0     ana     20  engenharia       sao paulo
1   bruno     22  computacao  rio de janeiro
2   carla     21    medicina  belo horizonte
3  daniel     23     direito        salvador
4   elisa     19    biologia          recife

In [25]:
alunos_ordenado = alunos.sort_values(by='nome')

In [26]:
alunos_ordenado

     nome  idade      cursos          cidade
0     ana     20  engenharia       sao paulo
1   bruno     22  computacao  rio de janeiro
2   carla     21    medicina  belo horizonte
3  daniel     23     direito        salvador
4   elisa     19    biologia          recife

---

**Exercício 8: Aplicando Funções**
 
No DataFrame alunos, crie uma nova coluna chamada 'Idade_Dobrada' que 
contenha o dobro da idade de cada aluno.

---

In [27]:
alunos['idade dobrada'] = alunos['idade']*2

In [28]:
alunos

     nome  idade      cursos          cidade  idade dobrada
0     ana     20  engenharia       sao paulo             40
1   bruno     22  computacao  rio de janeiro             44
2   carla     21    medicina  belo horizonte             42
3  daniel     23     direito        salvador             46
4   elisa     19    biologia          recife             38